Catalogs/Делопроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Делопроизводство</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Должники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПисьма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделРабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/АдресацияЗадачПоОтделам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>АдресацияЗадачПоОтделам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Делопроизводство/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	
			//БП_Делопроизводство=БизнесПроцессы.БизнесПроцесс_Делопроизводство.СоздатьБизнесПроцесс();
			//БП_Делопроизводство.Дата=ТекущаяДата();
			//БП_Делопроизводство.Автор=Ссылка.Сотрудник;
			//БП_Делопроизводство.Делопроизводство=Ссылка;
			//БП_Делопроизводство.Наименование="БП_Отдел_"+Ссылка.ОтделРабота+"_Вид документа-"+Ссылка.ВидДокумента+"_Номер дела-"+Ссылка.НомерДела;
			//БП_Делопроизводство.ДатаЗавершения=ТекущаяДата()+60*60*24*7;
			//БП_Делопроизводство.Должник=Ссылка.Владелец;
			//БП_Делопроизводство.ОтделРабота=Ссылка.ОтделРабота;
			//БП_Делопроизводство.Записать();
			//БП_Делопроизводство.Старт();
			//
			//
			////Создать напоминание для отдела
			//СоздатьНапоминаниеДляОтдела(Ссылка.ОтделРабота);
			// 
	
	
КонецПроцедуры


&НаСервере
Процедура СоздатьНапоминаниеДляОтдела(судСтадия)

			   
				
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	АдресацияЗадачПоОтделам.Сотрудник КАК Сотрудник
				|ИЗ
				|	РегистрСведений.АдресацияЗадачПоОтделам КАК АдресацияЗадачПоОтделам
				|ГДЕ
				|	АдресацияЗадачПоОтделам.Отдел = &Отдел";
			
			Запрос.УстановитьПараметр("Отдел", судСтадия);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				
				
				 наименованиеСотр=СтрЗаменить(ВыборкаДетальныеЗаписи.Сотрудник.Наименование,"_"," "); 
				
				 спрПользователь=Справочники.Пользователи.НайтиПоНаименованию(наименованиеСотр);
						
								
											
				
				
				
				
				 СрокНапоминания = НачалоДня(ТекущаяДата());
				 НапоминаниеТекст = "Выполнить задание ";
				 ПараметрыНапоминания    = Новый Структура;   
				 ПараметрыНапоминания.Вставить("Пользователь",спрПользователь);
				ПараметрыНапоминания.Вставить("ВремяСобытия"    , ТекущаяДата());
				ПараметрыНапоминания.Вставить("Источник"        , Ссылка);
				ПараметрыНапоминания.Вставить("Описание"        , НапоминаниеТекст);
				ПараметрыНапоминания.Вставить("СрокНапоминания", СрокНапоминания);
				ПараметрыНапоминания.Вставить("СпособУстановкиВремениНапоминания", Перечисления.СпособыУстановкиВремениНапоминания.Периодически);
				НапоминанияПользователяСлужебный.ПодключитьНапоминание(ПараметрыНапоминания);
				
				
				
				
				
			КонецЦикла;
			
КонецПроцедуры
